attacker145/NRF51822/main.c
/*
 * Convert uint32_t hex value to an uint8_t array.
 */
void hexdec_long( uint32_t count )
{	
    uint8_t ones;
    uint8_t tens;
    uint8_t hundreds;
    uint8_t thousands;
    uint8_t thousand10s;
    uint8_t thousand100s;
    uint8_t mill;
    uint8_t mill10s;
    uint8_t mill100s;
    uint8_t bills;
    
		bills						= 0;
		mill100s				= 0;
		mill10s					= 0;			
		mill						= 0;
		thousand100s 		= 0;
		thousand10s 		= 0;
		thousands 			= 0;
		hundreds 				= 0;
		tens  					= 0;						
		ones 						= 0;

		while ( count >= 1000000000 )
		{
			count -= 1000000000;				// subtract 1000000000, one billion		
			bills++;										// increment billions
		}
		while ( count >= 100000000 )
		{
			count -= 100000000;					// subtract 100000000, 100 million		
			mill100s++;									// increment 100th millions
		}
		while ( count >= 10000000 )
		{
			count -= 10000000;					// subtract 10000000		
			mill10s++;									// increment 10th millions
		}
		while ( count >= 1000000 )
		{
			count -= 1000000;						// subtract 1000000	
			mill++;											// increment 1 millions
		}	
		while ( count >= 100000 )
		{
			count -= 100000;						// subtract 100000		
			thousand100s++;							// increment 100th thousands
		}	
		while ( count >= 10000 )
		{
			count -= 10000;             // subtract 10000
			thousand10s++;							// increment 10th thousands
		}
		while ( count >= 1000 )
		{
			count -= 1000;							// subtract 1000	
			thousands++;								// increment thousands
		}
		while ( count >= 100 )
		{
			count -= 100;               // subtract 100	
			hundreds++;                 // increment hundreds
		}
		while ( count >= 10 )
		{
			count -= 10;								// subtract 10		
			tens++;											// increment tens
		}
			ones = count;								// remaining count equals ones
				
			Rx_buf[0]= bills + 0x30;    //Conver HEX to character
			Rx_buf[1]= mill100s + 0x30;
      Rx_buf[2]= mill10s + 0x30;
      Rx_buf[3]= mill + 0x30;
      Rx_buf[4]= thousand100s + 0x30;
      Rx_buf[5]= thousand10s + 0x30;
      Rx_buf[6]= thousands + 0x30;
      Rx_buf[7]= hundreds + 0x30;
      Rx_buf[8]= tens   + 0x30;
      Rx_buf[9]= ones + 0x30;
}
/*
 * Convert uint8_t hex value to an uint8_t array.
 */
void hexdec_char( uint8_t countc )
{	
	hundredsc = 0;
	tensc  		= 0;						
	onesc 		= 0;
	while ( countc >= 100 )
	{
		countc -= 100;	// subtract 100
		hundredsc++;		// increment hundreds
	}

	while ( countc >= 10 )
	{
		countc -= 10;		// subtract 10
		tensc++;				// increment tens
	}

	onesc = countc;		// remaining count equals ones
	Rx_bufc[0] = hundredsc + 0x30;
	Rx_bufc[1] = tensc + 0x30;
	Rx_bufc[2] = onesc + 0x30;
}
/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
    //NRF_LOG_PRINTF(" Transfer completed.\r\n");
		uint32_t Result = 0;
		Result = (uint32_t) m_rx_buf[0];
	  Result = (Result << 8);
	  Result = (Result + (uint32_t)m_rx_buf[1]);
	  Result = (Result << 8);
	  Result = (Result + (uint32_t)m_rx_buf[2]);
		hexdec_long( Result );				// Fills up Rx_buf
//#define UART_SPI
#ifdef UART_SPI	
    if (m_rx_buf[0] != 0)
    {  
      
				NRF_LOG_PRINTF("SPI DATA Rx: %s\r\n", m_rx_buf);		
				NRF_LOG_PRINTF("SPI DATA Rx: %s\r\n", Rx_buf);
				NRF_LOG_PRINTF("   SPI Rx bytes: %d\r\n", m_length_conv);
			
    }
		else
		{
				//printf("SPI Received: No Data\r\n");
		}
#endif		
		//if (m_tx_buf[0] != 0)
    //{				  
				//NRF_LOG_PRINTF(" Trasmitted: %s\r\n",m_tx_buf);
		//		NRF_LOG_PRINTF("SPI DATA Tx: %s\r\n",spibuff);
		//		NRF_LOG_PRINTF("   SPI Tx bytes: %d\r\n",m_length_conv);
    //}
}

/**
 * @brief SPI user event handler.
 * @param event
 */

void spi_event_handler_init(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
    //NRF_LOG_PRINTF(" Transfer completed.\r\n");		
}
// SPI END


#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                     "Nordic_UART"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

