attacker145/NRF51822/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
//unsigned char *uart;

int main(void)
{
    uint32_t err_code;
		uint8_t cntr = 0;
	
		uint8_t str1[] = "Number Bytes sent";	
		uint8_t str2[] = "Config Data:";
		uint8_t str3[] = "Regist Data:";
		uint8_t str4[] = "*******************";
//		uint8_t str5[] = "!DRDY, RDATAC sent";
		
    bool 		erase_bonds;
								
		nrf_gpio_cfg_output(21);				// START
		nrf_gpio_pin_set(21);						// START set high
		nrf_gpio_cfg_output(22);				// ADC RESET
		nrf_gpio_pin_set(22);						// ADC RESET set hight
		nrf_gpio_cfg_input(23, NRF_GPIO_PIN_NOPULL );
		//RESET pin low, START pin low, CS high
		nrf_gpio_pin_clear(22);					// RESET pin low
		nrf_gpio_pin_clear(21);					// START pin low
		nrf_delay_ms(40);
		//RESET pin high, START pin high		
		nrf_gpio_pin_set(21);			  		// START pin high
		nrf_delay_ms(2);
		nrf_gpio_pin_set(22);						// RESET pin high
		
		
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		//SPI-------------------------------------------------------------------------------
	  /*
	   *nrf_drv_config.h
	   *#define SPI0_CONFIG_SCK_PIN         16
	   *#define SPI0_CONFIG_MOSI_PIN        17
     *#define SPI0_CONFIG_MISO_PIN        18
		*/
		nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG(SPI_INSTANCE);	// Configure SPI nrf_drv_spi.h line 151
    spi_config.ss_pin = SPI_CS_PIN;				//CS is pin 19
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler)); //spi_event_handler_init
		//APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler_init));
		
		
		
		//----------------------------------------------------------------------------------
		// Initialize ADC******************************************************************************************
		//while(1){
		nrf_delay_ms(1);	
		spi_tx_buff_ptr = adc_setup_TC;	//Initialize pointer to ADC config: static uint8_t adc_setup_TC[]			= {0x40,0x03,0x01,0x02,0x40,0x71};			
		// Reset rx buffer and transfer done flag
    memset(m_rx_buf, 0, length_rx_buf);
    spi_xfer_done = false;
		//Configure ADC		
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
		//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, adc_setup_TC, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
		while (!spi_xfer_done)
    {
			__WFE();
    }		
		//nrf_drv_spi_uninit(&spi);		
		hexdec_char( (uint8_t) m_length_setup_tc );		// Number of bytes sent
		temp_buf2[0] = Rx_bufc[0];
		temp_buf2[1] = Rx_bufc[1];
		temp_buf2[2] = Rx_bufc[2];
		//NRF_LOG_PRINTF("Bytes sent: %s\r\n", Rx_bufc);
		
		
		// Config. data
		hexdec_char( (uint8_t) adc_setup_TC[0] );				// Fills up Rx_bufc	
		temp_buf[0] = Rx_bufc[0];
		temp_buf[1] = Rx_bufc[1];
		temp_buf[2] = Rx_bufc[2];	
		hexdec_char( (uint8_t) adc_setup_TC[1] );				// Fills up Rx_bufc
		temp_buf[3] = Rx_bufc[0];
		temp_buf[4] = Rx_bufc[1];
		temp_buf[5] = Rx_bufc[2];
		hexdec_char( (uint8_t) adc_setup_TC[2] );				// Fills up Rx_bufc
		temp_buf[6] = Rx_bufc[0];
		temp_buf[7] = Rx_bufc[1];
		temp_buf[8] = Rx_bufc[2];
		hexdec_char( (uint8_t) adc_setup_TC[3] );				// Fills up Rx_bufc	
		temp_buf[9] = Rx_bufc[0];
		temp_buf[10] = Rx_bufc[1];
		temp_buf[11] = Rx_bufc[2];	
		hexdec_char( (uint8_t) adc_setup_TC[4] );				// Fills up Rx_bufc
		temp_buf[12] = Rx_bufc[0];
		temp_buf[13] = Rx_bufc[1];
		temp_buf[14] = Rx_bufc[2];
		hexdec_char( (uint8_t) adc_setup_TC[5] );				// Fills up Rx_bufc
		temp_buf[15] = Rx_bufc[0];
		temp_buf[16] = Rx_bufc[1];
		temp_buf[17] = Rx_bufc[2];		
		NRF_LOG_PRINTF("Send Reg: %s\r\n", temp_buf);
		
				
		nrf_delay_ms(1);					
		//Read Registers *************************************************************************************************************
		spi_tx_buff_ptr = read_reg;		// Initialize pointer to read register buffer	
		// Reset rx buffer and transfer done flag
    memset(m_rx_buf, 0, length_rx_buf);
    spi_xfer_done = false;	
		// Read internal registers into m_rx_buf
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, length_read_reg, m_rx_buf, length_read_reg));
		//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, read_reg, length_read_reg, m_rx_buf, length_read_reg));
		while (!spi_xfer_done)
    {
			__WFE();
    }
		
