attacker145/NRF51822/main.c
		//{0x20,0x05,0x00,0x00,0x00,0x00,0x00,0x00};
		//nrf_drv_spi_uninit(&spi);
		hexdec_char( (uint8_t) read_reg [0]);
		temp_buf1[0] = Rx_bufc[0];
		temp_buf1[1] = Rx_bufc[1];
		temp_buf1[2] = Rx_bufc[2];
		hexdec_char( (uint8_t) read_reg [1]);
		temp_buf1[3] = Rx_bufc[0];
		temp_buf1[4] = Rx_bufc[1];
		temp_buf1[5] = Rx_bufc[2];		
		hexdec_char( (uint8_t) m_rx_buf[2] );				// Returned Data Fills up Rx_bufc
		temp_buf1[6] = Rx_bufc[0];
		temp_buf1[7] = Rx_bufc[1];
		temp_buf1[8] = Rx_bufc[2];
		hexdec_char( (uint8_t) m_rx_buf[3] );				// Returned Data Fills up Rx_bufc
		temp_buf1[9] = Rx_bufc[0];
		temp_buf1[10] = Rx_bufc[1];
		temp_buf1[11] = Rx_bufc[2];
		hexdec_char( (uint8_t) m_rx_buf[4] );				// Returned Data Fills up Rx_bufc
		temp_buf1[12] = Rx_bufc[0];
		temp_buf1[13] = Rx_bufc[1];
		temp_buf1[14] = Rx_bufc[2];
		hexdec_char( (uint8_t) m_rx_buf[5] );				// Returned Data Fills up Rx_bufc		
		temp_buf1[15]  = Rx_bufc[0];
		temp_buf1[16] = Rx_bufc[1];
		temp_buf1[17] = Rx_bufc[2];	
		//hexdec_char( (uint8_t) m_rx_buf[6] );				// Fills up Rx_bufc
		//temp_buf1[18] = Rx_bufc[0];
		//temp_buf1[19] = Rx_bufc[1];
		//temp_buf1[20] = Rx_bufc[2];
		//hexdec_char( (uint8_t) m_rx_buf[7] );				// Fills up Rx_bufc
		//temp_buf1[21] = Rx_bufc[0];
		//temp_buf1[22] = Rx_bufc[1];
		//temp_buf1[23] = Rx_bufc[2];
		//hexdec_char( (uint8_t) m_rx_buf[8] );
		//temp_buf1[24] = Rx_bufc[0];
		//temp_buf1[25] = Rx_bufc[1];
		//temp_buf1[26] = Rx_bufc[2];	
		//hexdec_char( (uint8_t) m_rx_buf[9] );				// Fills up Rx_bufc
		//temp_buf1[27] = Rx_bufc[0];
		//temp_buf1[28] = Rx_bufc[1];
		//temp_buf1[29] = Rx_bufc[2];
		//hexdec_char( (uint8_t) m_rx_buf[10] );				// Fills up Rx_bufc
		//temp_buf1[30] = Rx_bufc[0];
		//temp_buf1[31] = Rx_bufc[1];
		//temp_buf1[32] = Rx_bufc[2];
		NRF_LOG_PRINTF("Read Reg: %s\r\n", temp_buf1);		
		//hexdec_char( (uint8_t) m_rx_buf[9] );				// Fills up Rx_bufc		
		//NRF_LOG_PRINTF("Read Reg9: %s\r\n", Rx_bufc);	
		//hexdec_char( (uint8_t) m_rx_buf[10] );				// Fills up Rx_bufc
		//NRF_LOG_PRINTF("Read Reg10: %s\r\n", Rx_bufc);
		//hexdec_char( (uint8_t) m_rx_buf[11] );				// Fills up Rx_bufc
		//NRF_LOG_PRINTF("Read Reg11: %s\r\n", Rx_bufc);
		nrf_delay_ms(100);
	//}
		
	
	
		//nrf_drv_spi_uninit(&spi);
		//nrf_delay_ms(10);
		//APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler)); // Run handler
		
		
    printf("\r\nUART Start!\r\n");				 
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    										
/*				
		while(nrf_gpio_pin_read (23)){} // Wait for !DRDY
		
		ble_nus_string_send(&m_nus, str5, sizeof(str5));
		spi_tx_buff_ptr = read_data_cont;	//Read data continuously
		// Reset rx buffer and transfer done flag
		memset(m_rx_buf, 0, length_rx_buf);
		spi_xfer_done = false;				
		//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, m_length, m_rx_buf, m_length)); // Sends: #define TEST_STRING "Nordic"
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, length_read_data_cont, m_rx_buf, length_read_data_cont));
		while (!spi_xfer_done)
		{
				__WFE();
		}
		nrf_delay_ms(10);				
*/		
		// The main loop.
    for (;;)
    {
				//-- SPI---
			
				nrf_gpio_pin_set(21);						// START set high			
				nrf_delay_ms(1);	
						
				spi_tx_buff_ptr = adc_data;
				// Reset rx buffer and transfer done flag
				memset(m_rx_buf, 0, length_rx_buf);
				spi_xfer_done = false;
			
				while(nrf_gpio_pin_read (23)){
					power_manage();
				}//!DRDY read_data_cont	
				if(!nrf_gpio_pin_read (23)){
					//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, m_length, m_rx_buf, m_length)); // Sends: #define TEST_STRING "Nordic"
					APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spi_tx_buff_ptr, m_length_conv, m_rx_buf, m_length_conv));
					while (!spi_xfer_done)
					{
						__WFE();
					}	
					LEDS_INVERT(BSP_LED_1_MASK);
				}
				else{
					
				}
				nrf_gpio_pin_clear(21);						// START set low
				nrf_delay_ms(1);

				
				if ((cntr%100) == 0 || cntr == 0){
					ble_nus_string_send(&m_nus, str4, sizeof(str4));
					ble_nus_string_send(&m_nus, str2, sizeof(str2));
					ble_nus_string_send(&m_nus, temp_buf, 18);
					ble_nus_string_send(&m_nus, str3, sizeof(str3));
					ble_nus_string_send(&m_nus, temp_buf1, 18);	
					ble_nus_string_send(&m_nus, str1, sizeof(str1));
					ble_nus_string_send(&m_nus, temp_buf2, 3);
					ble_nus_string_send(&m_nus, str4, sizeof(str4));	
				}
				
#ifdef DEBUG				
				if ((cntr%10) == 0 || cntr == 0){
					//ble_nus_string_send(&m_nus, temp_buf, 18);
					//ble_nus_string_send(&m_nus, temp_buf1, 18);								
					spi_tx_buff_ptr = adc_setup_TC;
					m_length_conv = sizeof(adc_setup_TC);
				}
				else if((cntr%15) == 0){
					spi_tx_buff_ptr = read_reg;
					m_length_conv = sizeof(read_reg);	//Read register
				}
				else{
					spi_tx_buff_ptr = adc_data;
					m_length_conv = sizeof(adc_data);
				}
																			
				if ((cntr%15) == 0){
					hexdec_char( (uint8_t) m_rx_buf[2] );
					temp_buf1[0] = Rx_bufc[0];
					temp_buf1[1] = Rx_bufc[1];
					temp_buf1[2] = Rx_bufc[2];
					hexdec_char( (uint8_t) m_rx_buf[3] );				// Fills up Rx_bufc
					temp_buf1[3] = Rx_bufc[0];
					temp_buf1[4] = Rx_bufc[1];
					temp_buf1[5] = Rx_bufc[2];
					hexdec_char( (uint8_t) m_rx_buf[4] );				// Fills up Rx_bufc
					temp_buf1[6] = Rx_bufc[0];
					temp_buf1[7] = Rx_bufc[1];
					temp_buf1[8] = Rx_bufc[2];
					hexdec_char( (uint8_t) m_rx_buf[5] );				// Fills up Rx_bufc		
					temp_buf1[9]  = Rx_bufc[0];
					temp_buf1[10] = Rx_bufc[1];
					temp_buf1[11] = Rx_bufc[2];	
					hexdec_char( (uint8_t) m_rx_buf[6] );				// Fills up Rx_bufc
					temp_buf1[12] = Rx_bufc[0];
					temp_buf1[13] = Rx_bufc[1];
					temp_buf1[14] = Rx_bufc[2];
					hexdec_char( (uint8_t) m_rx_buf[7] );				// Fills up Rx_bufc
					temp_buf1[15] = Rx_bufc[0];
					temp_buf1[16] = Rx_bufc[1];
					temp_buf1[17] = Rx_bufc[2];
					ble_nus_string_send(&m_nus, temp_buf1, 18);
				}
#endif
				
				//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, test, length_test, m_rx_buf, length_test));
				//while (!spi_xfer_done)
				//{
            //__WFE();
				//}
					//ble_nus_string_send(&m_nus, m_rx_buf, 6);  //Rx_buf
				ble_nus_string_send(&m_nus, Rx_buf, 10);	// Rx_buf is filled up in the handler				
				LEDS_INVERT(BSP_LED_0_MASK);
				nrf_delay_ms(500);
				cntr++;
			}					           
}


/** 
 * @}
 */
